HafthorArni/nRF52840_Mousejacker/nrf52840_sniffer/extras/main_sniffer_with_nrf24.cpp
/*
 * nRF52840 Sniffer + nRF24L01+ Transmitter Test Bench
 * * This script runs on a single nRF52840 board.
 * - The nRF52840 (internal RADIO) acts as the "Sniffer".
 * - An attached nRF24L01+ (external) acts as a "Target" transmitter.
 * * The goal is to use the Sniffer UI to find and deconstruct the packets
 * being sent by its own nRF24.
 */

#include <Arduino.h>

// nRF24 (Sender) libraries
#include <SPI.h>
#include <nRF24L01.h>
#include <RF24.h>

// ---------------- Pins / Serial ----------------
#define LED_PIN       LED_BUILTIN
#define BUTTON_PIN    7
#define SERIAL_BAUD   250000

// nRF24 (Sender) Pin Config
#define RF24_CE_PIN   9
#define RF24_CSN_PIN  10

// nRF24 (Sender) object
RF24 radio(RF24_CE_PIN, RF24_CSN_PIN);

// ---------------- nRF24 (Sender) Target Config -----------------
#define TARGET_RF_CHANNEL         50
#define TARGET_RADIO_PAYLOAD_SIZE 32
static const uint8_t target_rf_address[5] = { 0xE7, 0xE7, 0xE7, 0xE7, 0xE7 };

// ---------------- Sweep config -----------------
#define MIN_CH        0
#define MAX_CH        99
#define DWELL_MS      100

// ---------------- Print gate -------------------
static int8_t PRINT_RSSI_THRESH = -30; // dBm

// ---------------- Radio buffer -----------------
#define RADIO_MAX_PAYLOAD 62
// Struct 'esb_rx_t' - defines the nRF52 RADIO's capture buffer structure
typedef struct __attribute__((packed)) {
  uint8_t LENGTH;
  uint8_t S1;
  uint8_t payload[RADIO_MAX_PAYLOAD];
} esb_rx_t;
static esb_rx_t esb_rx_buf;

#define MAX_PDU_SIZE (sizeof(esb_rx_t))

// ---------------- State machine ----------------
enum State { IDLE, SWEEPING, ANALYZING, LISTENING };
static volatile State currentState = IDLE;

// ---------------- Sweep bookkeeping ------------
static uint32_t ch_hits[(MAX_CH - MIN_CH + 1)];
static uint8_t  best_ch_found = MIN_CH;

// ---------------- Runtime radio params ----------
static bool     whitening_enabled = false;
static uint32_t current_mode = RADIO_MODE_MODE_Nrf_2Mbit;
static uint8_t  BALEN           = 1;   // 1..4 valid (address length = BALEN+1 bytes)
static uint8_t  LFLEN           = 0;   // 0..8 bits (payload length field bits)
static uint8_t  S1LEN           = 0;   // 0..7 bits (S1 bits)
static uint8_t  STATLEN         = 32;  // fixed capture length
static uint8_t  current_crc_len = 0; // 0=Disabled, 1=1 byte, 2=2 bytes
static bool     header_parse_enabled = false;
static bool     locked = false;
static int8_t   bit_shift_amount = 0; // -7 (left) to +7 (right)
static bool     payload_endian_little = false;
static uint8_t  crc_param_profile = 0;
static bool     crc_skip_addr = false;
static uint8_t  preamble_trick_mode = 0; // 0=Off, 1=0xAA, 2=0x55, 3=0xAAAA, 4=0x5555

// ---------------- RSSI tracking -----------------
static volatile int8_t  last_rssi_dbm = -127;
static volatile bool    rssi_ready    = false;

// ---------------- Address discovery -------------
static const uint16_t SCAN_DWELL_MS = 200;
static volatile uint32_t scan_pkt_count  = 0;
static volatile uint32_t scan_addr_count = 0;
static bool suppress_prints = false; // suppress during scans

static bool     have_prefix = false;
static uint8_t  discovered_prefix = 0xAA;
static uint8_t  discovered_base[4] = {0};
static uint8_t  discovered_count = 0;

// ---------------- Record/Replay state ----------
#define MAX_RECORDED_PACKETS 50
#define MAX_RECORDED_PAYLOAD 64

typedef struct {
  uint8_t len;
  uint8_t data[MAX_RECORDED_PAYLOAD];
  uint32_t timestamp_ms; // Record timing between packets
} RecordedPacket;

static RecordedPacket recorded_packets[MAX_RECORDED_PACKETS];
static uint16_t recorded_packet_count = 0;
static bool is_recording = false;

// ---------------- Utils ------------------------
static inline void print_ts() {
  Serial.print('['); Serial.print(millis()); Serial.print(" ms] ");
}
static void print_hex(const uint8_t* b, size_t n) {
  for (size_t i=0;i<n;i++) { if (b[i] < 0x10) Serial.print('0'); Serial.print(b[i], HEX); Serial.print(' '); }
  Serial.println();
}


/**
 * @brief Applies a bit shift to an entire byte array, in-place.
 * Used to correct for bit-alignment issues in received payloads.
 * @param shift_bits Positive=RIGHT, Negative=LEFT
 */
static void apply_bit_shift(uint8_t* buffer, size_t len, int8_t shift_bits) {
  if (len == 0 || shift_bits == 0) return;

  int8_t shift = shift_bits % 8;
  if (shift == 0) return;

  if (shift > 0) {
    // --- Shift RIGHT by 'shift' bits ---
    int8_t rshift = shift;
    uint8_t carry = 0;
    for (int i = (int)len - 1; i >= 0; i--) { 
      uint8_t next_carry = (buffer[i] << (8 - rshift));
      buffer[i] = (buffer[i] >> rshift) | carry;
      carry = next_carry;
    }
  } else {
    // --- Shift LEFT by 'abs(shift)' bits ---
    int8_t lshift = -shift;
    uint8_t carry = 0;
    for (size_t i = 0; i < len; i++) {
      uint8_t next_carry = (buffer[i] >> (8 - lshift));
      buffer[i] = (buffer[i] << lshift) | carry;
      carry = next_carry;
    }
  }
}

// Function prototype for new firing function
void fire_recorded_packets();

// ------------------ Target TX (nRF24) Functions ------------------
/**
 * @brief Configures the external nRF24L01+ as the target transmitter.
 */
static void configure_target_transmitter() {
  Serial.println("Configuring nRF24 as TARGET TRANSMITTER...");
  if (!radio.begin()) {
    Serial.println("nRF24L01+ (Sender) not responding. Check wiring.");
    Serial.println("TX will fail!");
    return;
  }
  radio.setDataRate(RF24_1MBPS);
  radio.setChannel(TARGET_RF_CHANNEL);
  radio.setAddressWidth(5);
  radio.openWritingPipe(target_rf_address);
  radio.setPALevel(RF24_PA_MAX);
  radio.setCRCLength(RF24_CRC_16);
  radio.setAutoAck(false);
  radio.setRetries(0, 0);
  radio.setPayloadSize(TARGET_RADIO_PAYLOAD_SIZE);
  radio.stopListening();
  Serial.println("nRF24 TARGET configured. Will start transmitting in loop.");
}

static unsigned long last_tx_time = 0;
static uint8_t tx_counter = 0;

/**
 * @brief Non-blocking function to send a "Hello" packet every ~1s
 * from the external nRF24.
 */
static void run_target_transmitter() {
  if (millis() - last_tx_time < 1000) {
    return;
  }
  last_tx_time = millis();

