HafthorArni/nRF52840_Mousejacker/nrf52840_sniffer/extras/main_sniffer_with_nrf24.cpp
  char tx[TARGET_RADIO_PAYLOAD_SIZE] = {0};
  strcpy(tx, "Hello Sniffer!");
  tx[14] = tx_counter++;

  radio.write(&tx, TARGET_RADIO_PAYLOAD_SIZE);
}

// ---------------- Low-level RADIO (Sniffer) control -------
static inline void radio_disable() {
  NRF_RADIO->TASKS_DISABLE = 1;
  while (NRF_RADIO->EVENTS_DISABLED == 0) {}
  NRF_RADIO->EVENTS_DISABLED = 0;
}

void set_channel(uint8_t ch) {
  radio_disable();
  NRF_RADIO->FREQUENCY = ch;
  NRF_RADIO->EVENTS_READY   = 0;
  NRF_RADIO->EVENTS_ADDRESS = 0;
  NRF_RADIO->EVENTS_END     = 0;
  NRF_RADIO->EVENTS_RSSIEND = 0;

  rssi_ready = false;
  last_rssi_dbm = -127;
  memset(&esb_rx_buf, 0, sizeof(esb_rx_buf));
  NRF_RADIO->PACKETPTR = (uint32_t)&esb_rx_buf;
  NRF_RADIO->TASKS_RXEN = 1;
}

/**
 * @brief Applies PCNF0 and PCNF1 settings, handling the
 * Preamble Trick mode override.
 */
void apply_pcnf0_pcnf1() {
  if (preamble_trick_mode > 0) {
    // --- PREAMBLE "TRICK" MODE ---
    // Use the preamble (e.g., 0xAA) as the address by setting PLEN=0
    uint8_t trick_balen = 0;
    switch (preamble_trick_mode) {
      case 1: // 0xAA
      case 2: // 0x55
        trick_balen = 0; // 1-byte address
        break;
      case 3: // 0xAAAA
      case 4: // 0x5555
        trick_balen = 1; // 2-byte address
        break;
    }

    NRF_RADIO->PCNF0 =
      (0 << RADIO_PCNF0_S0LEN_Pos) |
      (LFLEN << RADIO_PCNF0_LFLEN_Pos) |
      (S1LEN << RADIO_PCNF0_S1LEN_Pos) |
      (3 << RADIO_PCNF0_PLEN_Pos); // Use 3 for 0-bit preamble (undocumented)

    uint32_t pcnf1 = 0;
    pcnf1 |= (whitening_enabled ? RADIO_PCNF1_WHITEEN_Enabled : RADIO_PCNF1_WHITEEN_Disabled) << RADIO_PCNF1_WHITEEN_Pos;
    pcnf1 |= (payload_endian_little ? RADIO_PCNF1_ENDIAN_Little : RADIO_PCNF1_ENDIAN_Big) << RADIO_PCNF1_ENDIAN_Pos;
    pcnf1 |= (trick_balen << RADIO_PCNF1_BALEN_Pos); // Use trick BALEN
    pcnf1 |= (STATLEN << RADIO_PCNF1_STATLEN_Pos);
    pcnf1 |= (RADIO_MAX_PAYLOAD << RADIO_PCNF1_MAXLEN_Pos);
    NRF_RADIO->PCNF1 = pcnf1;

  } else {
    // --- NORMAL ADDRESS DISCOVERY MODE ---
    NRF_RADIO->PCNF0 =
      (0 << RADIO_PCNF0_S0LEN_Pos) |
      (LFLEN << RADIO_PCNF0_LFLEN_Pos) |
      (S1LEN << RADIO_PCNF0_S1LEN_Pos) |
      (RADIO_PCNF0_PLEN_8bit << RADIO_PCNF0_PLEN_Pos); // Default 8-bit preamble

    uint32_t pcnf1 = 0;
    pcnf1 |= (whitening_enabled ? RADIO_PCNF1_WHITEEN_Enabled : RADIO_PCNF1_WHITEEN_Disabled) << RADIO_PCNF1_WHITEEN_Pos;
    pcnf1 |= (payload_endian_little ? RADIO_PCNF1_ENDIAN_Little : RADIO_PCNF1_ENDIAN_Big) << RADIO_PCNF1_ENDIAN_Pos;
    pcnf1 |= (BALEN << RADIO_PCNF1_BALEN_Pos); // Use normal BALEN
    pcnf1 |= (STATLEN << RADIO_PCNF1_STATLEN_Pos);
    pcnf1 |= (RADIO_MAX_PAYLOAD << RADIO_PCNF1_MAXLEN_Pos);
    NRF_RADIO->PCNF1 = pcnf1;
  }
}

/**
 * @brief Configures all base nRF52 RADIO settings (CRC, Address, etc.)
 * This handles Preamble Trick mode vs. normal Address Discovery.
 */
void radio_base_config() {
  NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
  NRF_CLOCK->TASKS_HFCLKSTART = 1;
  while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0) {}

  NRF_RADIO->MODE = current_mode << RADIO_MODE_MODE_Pos;
  
  apply_pcnf0_pcnf1();

  // --- Address Logic ---
  if (preamble_trick_mode > 0) {
    // Preamble "Trick" Mode: Override address with preamble patterns
    uint8_t trick_prefix = 0;
    uint32_t trick_base = 0;

    switch (preamble_trick_mode) {
      case 1: trick_prefix = 0xAA; trick_base = 0;    break; // 0xAA
      case 2: trick_prefix = 0x55; trick_base = 0;    break; // 0x55
      case 3: trick_prefix = 0xAA; trick_base = 0xAA; break; // 0xAAAA
      case 4: trick_prefix = 0x55; trick_base = 0x55; break; // 0x5555
    }
    
    NRF_RADIO->BASE0   = trick_base;
    NRF_RADIO->BASE1   = 0x00000000UL;
    NRF_RADIO->PREFIX0 = trick_prefix;
    NRF_RADIO->PREFIX1 = 0;
    NRF_RADIO->RXADDRESSES = (1 << 0);
    
  } else {
    // Normal Address Discovery Mode
    if (have_prefix) {
      NRF_RADIO->PREFIX0 = discovered_prefix;
      NRF_RADIO->PREFIX1 = 0;
      NRF_RADIO->RXADDRESSES = (1 << 0);

      uint32_t final_base = 0;
      for(uint8_t i=0; i<discovered_count; i++) {
        final_base |= ((uint32_t)discovered_base[i]) << (8*i);
      }
      NRF_RADIO->BASE0 = final_base;
      NRF_RADIO->BASE1 = 0x00000000UL;
    } else {
      // Default settings (no address found yet)
      NRF_RADIO->BASE0    = 0x00000000UL;
      NRF_RADIO->BASE1    = 0x00000000UL;
      NRF_RADIO->PREFIX0  = 0xAA; // Default prefix to sniff
      NRF_RADIO->PREFIX1  = 0x00000000UL;
      NRF_RADIO->RXADDRESSES = (1 << 0);
    }
  }

  // --- CRC Poly/Init Profile ---
  switch (crc_param_profile) {
    case 0: // Default: nRF24, CCITT-FALSE
      NRF_RADIO->CRCPOLY = 0x00001021UL;
      NRF_RADIO->CRCINIT = 0x0000FFFFUL;
      break;
    case 1: // Kermit
      NRF_RADIO->CRCPOLY = 0x00001021UL;
      NRF_RADIO->CRCINIT = 0x00000000UL;
      break;
    case 2: // Modbus / CRC-16-IBM
      NRF_RADIO->CRCPOLY = 0x00008005UL;
      NRF_RADIO->CRCINIT = 0x0000FFFFUL;
      break;
    case 3: // ARC / CRC-16
      NRF_RADIO->CRCPOLY = 0x00008005UL;
      NRF_RADIO->CRCINIT = 0x00000000UL;
      break;
  }

  // Apply configurable CRC length
  uint32_t crc_val = RADIO_CRCCNF_LEN_Disabled;
  if (current_crc_len == 1) crc_val = RADIO_CRCCNF_LEN_One;
  else if (current_crc_len == 2) crc_val = RADIO_CRCCNF_LEN_Two;

  uint32_t crc_conf_val = (crc_val << RADIO_CRCCNF_LEN_Pos);

  if (crc_skip_addr) {
    crc_conf_val |= (RADIO_CRCCNF_SKIPADDR_Skip << RADIO_CRCCNF_SKIPADDR_Pos);
  }
  NRF_RADIO->CRCCNF = crc_conf_val;

  // Continuous RX
  NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_END_START_Msk;
  NRF_RADIO->MODECNF0 = (RADIO_MODECNF0_RU_Fast << RADIO_MODECNF0_RU_Pos);

  memset(&esb_rx_buf, 0, sizeof(esb_rx_buf));
  NRF_RADIO->PACKETPTR = (uint32_t)&esb_rx_buf;
}

void configure_radio_for_state(State s) {
  radio_disable();
  radio_base_config();
  if (s == SWEEPING)       set_channel(MIN_CH);
  else if (s == LISTENING) set_channel(best_ch_found);
}

// ---------------- Prefix helpers ----------------
static void restore_single_pipe_prefix(uint8_t prefix = 0xAA) {
  NRF_RADIO->PREFIX0 = prefix;
  NRF_RADIO->PREFIX1 = 0;
  NRF_RADIO->RXADDRESSES = (1 << 0);
  NRF_RADIO->BASE0 = 0x00000000UL;
  NRF_RADIO->BASE1 = 0x00000000UL;
}

// ---------------- Discovery reset/undo -----------
void discovery_reset_all() {
  have_prefix = false;
  discovered_prefix = 0xAA;
  memset(discovered_base, 0, sizeof(discovered_base));
  discovered_count = 0;
  
  BALEN = 1;
  restore_single_pipe_prefix(0xAA);
  set_channel(best_ch_found);
  Serial.println(">>> Discovery reset: prefix cleared, base bytes cleared, BALEN=1, default 0xAA single-pipe restored.");
}

// ---------------- Parameter dump ----------------
void print_params() {
  Serial.println(F("\n--- Current Settings ---"));
  Serial.print (F("State: "));
  switch (currentState) {
    case IDLE: Serial.println(F("IDLE")); break;
    case SWEEPING: Serial.println(F("SWEEPING")); break;
    case ANALYZING: Serial.println(F("ANALYZING")); break;
    case LISTENING: Serial.println(F("LISTENING")); break;
  }
  Serial.print (F("Locked channel: ")); Serial.println(best_ch_found);
  Serial.print (F("Data rate: ")); Serial.println((current_mode == RADIO_MODE_MODE_Nrf_2Mbit) ? "2 Mbps" : "1 Mbps");
  Serial.print (F("Whitening: ")); Serial.println(whitening_enabled ? "ENABLED" : "DISABLED");
  Serial.print (F("BALEN: ")); Serial.println(BALEN);
  Serial.print (F("LFLEN: ")); Serial.println(LFLEN);
  Serial.print (F("S1LEN: ")); Serial.println(S1LEN);
  Serial.print (F("STATLEN: ")); Serial.println(STATLEN);
  Serial.print (F("Header parse: ")); Serial.println(header_parse_enabled ? "ENABLED" : "DISABLED");
  Serial.print (F("Payload Endian: ")); Serial.println(payload_endian_little ? "Little (nRF)" : "Big (BLE)");
  Serial.print (F("RSSI print threshold: ")); Serial.print(PRINT_RSSI_THRESH); Serial.println(F(" dBm"));

  Serial.print (F("CRC: "));
  if (current_crc_len == 0) Serial.println(F("DISABLED"));
  else if (current_crc_len == 1) Serial.println(F("1 Byte"));
  else if (current_crc_len == 2) Serial.println(F("2 Bytes"));

  Serial.print (F("CRC Skip Address: ")); Serial.println(crc_skip_addr ? "Skip (Payload Only)" : "Include (Addr + Payload)");

  Serial.print (F("CRC Profile: "));
  switch (crc_param_profile) {
    case 0: Serial.println(F("0: Default (Poly:0x1021, Init:0xFFFF)")); break;
    case 1: Serial.println(F("1: Kermit  (Poly:0x1021, Init:0x0000)")); break;
    case 2: Serial.println(F("2: Modbus  (Poly:0x8005, Init:0xFFFF)")); break;
    case 3: Serial.println(F("3: ARC     (Poly:0x8005, Init:0x0000)")); break;
  }

  Serial.print (F("Preamble Sniff Trick: "));
  switch (preamble_trick_mode) {
    case 0: Serial.println(F("DEFAULT (Using Address Discovery)")); break;
    case 1: Serial.println(F("ON: 0xAA (1-byte)")); break;
    case 2: Serial.println(F("ON: 0x55 (1-byte)")); break;
    case 3: Serial.println(F("ON: 0xAAAA (2-byte)")); break;
    case 4: Serial.println(F("ON: 0x5555 (2-byte)")); break;
  }
  
  Serial.print (F("Bit Shift: ")); Serial.println(bit_shift_amount);

