HafthorArni/nRF52840_Mousejacker/nrf52840_sniffer/extras/main_sniffer_with_nrf24.cpp
  // Only print discovery info if Preamble Trick is OFF
  if (preamble_trick_mode == 0) {
    Serial.print (F("Discovered Addr: "));
    if (have_prefix) { Serial.print(F("0x")); Serial.print(discovered_prefix, HEX); }
    else { Serial.print(F("(none)")); }
    Serial.print(F(" + ")); Serial.print(discovered_count); Serial.println(F(" base byte(s)"));
    Serial.print(F("Discovered base (LSB->MSB): "));
    if (discovered_count==0) Serial.println(F("(none)"));
    else {
      for (uint8_t i=0;i<discovered_count;i++){ Serial.print("0x"); Serial.print(discovered_base[i], HEX); Serial.print(i<discovered_count-1?" ":""); }
      Serial.println();
    }
  }
  
  Serial.print(F("Recorded packets: ")); Serial.print(recorded_packet_count);
  Serial.print(F(" / ")); Serial.println(MAX_RECORDED_PACKETS);
  Serial.println(F("------------------------\n"));
}

void discovery_undo_last_byte() {
  if (discovered_count == 0) {
    Serial.println("Nothing to undo: no base bytes discovered yet.");
    return;
  }
  discovered_count--;
  Serial.print(">>> Undid base byte #"); Serial.println(discovered_count);

  uint32_t base = 0;
  for (uint8_t i=0;i<discovered_count;i++) base |= ((uint32_t)discovered_base[i]) << (8*i);
  NRF_RADIO->BASE0 = base;

  BALEN = (discovered_count == 0) ? 1 : discovered_count;
  
  if (have_prefix) restore_single_pipe_prefix(discovered_prefix);
  else restore_single_pipe_prefix(0xAA);

  set_channel(best_ch_found);
  print_params();
}

// ---------------- Event processing ----------------
/**
 * @brief This is the main packet processing function.
 * It checks for RADIO events (ADDRESS, RSSIEND, END),
 * determines payload length, records packets, and prints to serial.
 */
void poll_radio_events(uint8_t channel, bool allow_prints) {
  if (NRF_RADIO->EVENTS_ADDRESS) {
    NRF_RADIO->EVENTS_ADDRESS = 0;

    // Start RSSI sampling as soon as address is matched
    rssi_ready = false;
    NRF_RADIO->EVENTS_RSSIEND = 0;
    NRF_RADIO->TASKS_RSSISTART = 1;
  }
  if (NRF_RADIO->EVENTS_RSSIEND) {
    NRF_RADIO->EVENTS_RSSIEND = 0;
    uint8_t raw = NRF_RADIO->RSSISAMPLE;
    last_rssi_dbm = -(int8_t)raw;
    rssi_ready = true;
  }
  if (NRF_RADIO->EVENTS_END) {
    NRF_RADIO->EVENTS_END = 0;
    scan_pkt_count++;

    int8_t rssi = rssi_ready ? last_rssi_dbm : -127;

    bool crc_ok = true;
    if (current_crc_len > 0) {
      crc_ok = (NRF_RADIO->CRCSTATUS == 1);
    }

    // --- Determine true payload start and length ---
    uint8_t* payload_start_ptr;
    size_t   payload_actual_len;
    size_t   max_payload_bytes_in_buffer;
    bool plen_is_zero = (preamble_trick_mode > 0);
    
    if (LFLEN > 0 && !plen_is_zero) {
      // Dynamic length (and not Preamble Trick mode)
      uint8_t lmask = (LFLEN >= 8) ? 0xFFu : (uint8_t)((1u << LFLEN) - 1u);
      payload_actual_len = (size_t)(esb_rx_buf.LENGTH & lmask);

      if (S1LEN > 0) {
        payload_start_ptr = esb_rx_buf.payload;
        max_payload_bytes_in_buffer = RADIO_MAX_PAYLOAD;
      } else {
        payload_start_ptr = &esb_rx_buf.S1;
        max_payload_bytes_in_buffer = RADIO_MAX_PAYLOAD + 1;
      }
    } else {
      // Static length OR Preamble Trick mode
      payload_start_ptr = (uint8_t*)&esb_rx_buf.LENGTH;
      max_payload_bytes_in_buffer = RADIO_MAX_PAYLOAD + 2;
      payload_actual_len = (STATLEN == 0 || STATLEN > max_payload_bytes_in_buffer)
                           ? max_payload_bytes_in_buffer
                           : STATLEN;
    }

    if (payload_actual_len > max_payload_bytes_in_buffer) {
      payload_actual_len = max_payload_bytes_in_buffer;
    }
    if (payload_actual_len > MAX_PDU_SIZE) {
      payload_actual_len = MAX_PDU_SIZE;
    }
    // --- End length calculation ---

    if (rssi_ready && rssi >= PRINT_RSSI_THRESH && crc_ok) {
      scan_addr_count++; // Count as a valid "hit"

      // --- Packet Recording Logic ---
      if (is_recording && recorded_packet_count < MAX_RECORDED_PACKETS) {        
        uint8_t* pdu_start = (uint8_t*)&esb_rx_buf.LENGTH;
        size_t pdu_total_len;
        
        if (LFLEN > 0 && !plen_is_zero) {
          size_t header_size = 1 + (S1LEN > 0 ? 1 : 0);
          pdu_total_len = header_size + payload_actual_len;
        } else {
          pdu_total_len = payload_actual_len;
        }
        
        if (pdu_total_len > MAX_RECORDED_PAYLOAD) {
          pdu_total_len = MAX_RECORDED_PAYLOAD;
        }
        
        if (pdu_total_len > 0) {
          recorded_packets[recorded_packet_count].len = (uint8_t)pdu_total_len;
          memcpy(recorded_packets[recorded_packet_count].data, pdu_start, pdu_total_len);
          recorded_packets[recorded_packet_count].timestamp_ms = millis();
          recorded_packet_count++;
          
          // Blink LED "off" (it's solid on) to show packet capture
          digitalWrite(LED_PIN, HIGH); 
          delay(10);
          digitalWrite(LED_PIN, LOW);
        }
      }
      // --- END: Packet Recording Logic ---
    }

    // --- Printing ---
    if (allow_prints && !suppress_prints) {
      if (rssi >= PRINT_RSSI_THRESH) {
        uint8_t pipe = NRF_RADIO->RXMATCH & 0x07;
        print_ts();
        Serial.print("Ch "); Serial.print(channel);
        Serial.print(" pipe="); Serial.print(pipe);
        Serial.print(" RSSI="); Serial.print(rssi); Serial.print(" dBm");

        if (current_crc_len > 0) {
          Serial.print(crc_ok ? " CRC=OK " : " CRC=BAD ");
        } else {
          Serial.print("   -> ");
        }

        if (crc_ok) {
          if (header_parse_enabled && LFLEN > 0 && !plen_is_zero) {
            uint8_t lmask = (LFLEN >= 8) ? 0xFFu : (uint8_t)((1u << LFLEN) - 1u);
            uint8_t length_from_field = esb_rx_buf.LENGTH & lmask;
            Serial.print("LEN="); Serial.print(length_from_field);
            if (S1LEN > 0) {
              uint8_t s1mask = (S1LEN == 0) ? 0 : (uint8_t)((1u << S1LEN) - 1u);
              uint8_t s1 = esb_rx_buf.S1 & s1mask;
              Serial.print(" S1=0x"); Serial.print(s1, HEX);
            }
            Serial.print(" -> ");
          }
          
          // --- Apply bit shift before printing ---
          if (bit_shift_amount != 0) {
            uint8_t shifted_payload[MAX_PDU_SIZE]; 
            size_t len_to_process = (payload_actual_len > MAX_PDU_SIZE) ? MAX_PDU_SIZE : payload_actual_len;
            if (len_to_process > 0) {
              memcpy(shifted_payload, payload_start_ptr, len_to_process);
              apply_bit_shift(shifted_payload, len_to_process, bit_shift_amount);
            }
            print_hex(shifted_payload, len_to_process);
          } else {
            // No shift, print original
            print_hex(payload_start_ptr, payload_actual_len); 
          }
        } else {
          Serial.println(); // CRC bad
        }
      }
    }

