HafthorArni/nRF52840_Mousejacker/nrf52840_sniffer/extras/main_sniffer_with_nrf24.cpp
    // Reset for next packet
    memset(&esb_rx_buf, 0, sizeof(esb_rx_buf));
    rssi_ready = false;
    last_rssi_dbm = -127;
  }
}

// ----------------------- FIXED SWEEPER -----------------------
static inline void start_rx_for_sweep(uint8_t ch) {
  set_channel(ch);
  NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_END_START_Msk;
}

/**
 * @brief Sweeps all channels (MIN_CH to MAX_CH) once and finds the
 * channel with the most valid packets (gated by RSSI and CRC).
 * @return The best channel found, or 0 if no activity.
 */
uint8_t sweep_once_find_best() {
  memset(ch_hits, 0, sizeof(ch_hits));
  uint16_t best_hits = 0;
  uint8_t  best_ch   = 0;

  for (uint8_t ch = MIN_CH; ch <= MAX_CH; ++ch) {
    start_rx_for_sweep(ch);
    unsigned long t0 = millis();
    uint16_t local_hits = 0;

    while (millis() - t0 < DWELL_MS) {
      if (NRF_RADIO->EVENTS_ADDRESS) {
        NRF_RADIO->EVENTS_ADDRESS = 0;
        rssi_ready = false;
        NRF_RADIO->EVENTS_RSSIEND = 0;
        NRF_RADIO->TASKS_RSSISTART = 1;
      }

      if (NRF_RADIO->EVENTS_RSSIEND) {
        NRF_RADIO->EVENTS_RSSIEND = 0;
        last_rssi_dbm = -(int8_t)NRF_RADIO->RSSISAMPLE;
        rssi_ready = true;
      }

      if (NRF_RADIO->EVENTS_END) {
        NRF_RADIO->EVENTS_END = 0;

        bool crc_ok = (current_crc_len == 0) ? true : (NRF_RADIO->CRCSTATUS == 1);
        if (rssi_ready && last_rssi_dbm >= PRINT_RSSI_THRESH && crc_ok) {
          local_hits++;
        }
        rssi_ready = false;
        last_rssi_dbm = -127;
      }
    }

    ch_hits[ch - MIN_CH] = local_hits;
    if (local_hits > best_hits) { best_hits = local_hits; best_ch = ch; }
  }

  if (best_hits > 0) { best_ch_found = best_ch; return best_ch; }
  return 0;
}

// ---------------- Address discovery ----------------
/**
 * @brief Brute-force scan for the 1-byte prefix (0x00..0xFF).
 * Requires LISTENING on a locked channel.
 */
bool run_prefix_scan() {
  if (currentState != LISTENING) {
    Serial.println("Prefix scan requires LISTENING (locked channel). Sweep first.");
    return false;
  }
  if (preamble_trick_mode > 0) {
    Serial.println("Preamble Sniff Trick is ON. Disable with 'a' to use Address Discovery.");
    return false;
  }
  
  Serial.println("\n--- Prefix scan: starting (0x00..0xFF individually) ---");
  Serial.println("Tip: hold the device's button so your traffic dominates.");

  uint8_t  saved_BALEN   = BALEN;
  uint32_t saved_PREFIX0 = NRF_RADIO->PREFIX0;
  uint32_t saved_PREFIX1 = NRF_RADIO->PREFIX1;
  uint32_t saved_RXADDR  = NRF_RADIO->RXADDRESSES;
  uint32_t saved_BASE0   = NRF_RADIO->BASE0;

  BALEN = 1; // Force 1-byte base (2-byte total address) for prefix scan
  apply_pcnf0_pcnf1();
  suppress_prints = true;

  struct Cand { uint8_t p; uint32_t hits; };
  Cand top[5]; for (int i=0;i<5;i++){ top[i] = {0,0}; }

  const uint16_t dwell = SCAN_DWELL_MS;
  uint32_t last_pct = 0;

  for (uint16_t pref = 0; pref <= 0xFF; ++pref) {
    NRF_RADIO->PREFIX0 = (uint32_t)(uint8_t)pref;
    NRF_RADIO->PREFIX1 = 0;
    NRF_RADIO->RXADDRESSES = (1 << 0);
    NRF_RADIO->BASE0 = 0x00000000;
    set_channel(best_ch_found);

    scan_addr_count = 0;
    uint32_t t0 = millis();
    while (millis() - t0 < dwell) {
      poll_radio_events(best_ch_found, false);
    }

    uint32_t h = scan_addr_count;
    for (int i=0;i<5;i++){
      if (h > top[i].hits) {
        for (int j=4;j>i;--j) top[j] = top[j-1];
        top[i] = { (uint8_t)pref, h };
        break;
      }
    }

    uint32_t pct = ((pref+1) * 100UL) / 256UL;
    if (pct >= last_pct + 4) {
      Serial.print("Progress: "); Serial.print(pct); Serial.println("%");
      last_pct = pct;
    }
  }

  // --- Validation phase ---
  const uint16_t validate_ms = 300;
  const uint32_t min_hits    = 5;
  uint8_t best_prefix = 0;
  uint32_t best_hits  = 0;

  Serial.println("Validating top prefixes...");
  for (int i=0;i<5;i++) {
    if (top[i].hits == 0) continue;
    uint8_t p = top[i].p;

    NRF_RADIO->PREFIX0 = p;
    NRF_RADIO->PREFIX1 = 0;
    NRF_RADIO->RXADDRESSES = (1 << 0);
    NRF_RADIO->BASE0 = 0x00000000;
    set_channel(best_ch_found);

    scan_addr_count = 0;
    uint32_t t0 = millis();
    while (millis() - t0 < validate_ms) {
      poll_radio_events(best_ch_found, false);
    }
    Serial.print("   cand 0x"); Serial.print(p, HEX);
    Serial.print(" -> ADDRESS hits="); Serial.println((uint32_t)scan_addr_count);
    if (scan_addr_count > best_hits) {
      best_hits = scan_addr_count;
      best_prefix = p;
    }
  }

  // --- Restore settings ---
  suppress_prints = false;
  NRF_RADIO->PREFIX0 = saved_PREFIX0;
  NRF_RADIO->PREFIX1 = saved_PREFIX1;
  NRF_RADIO->RXADDRESSES = saved_RXADDR;
  NRF_RADIO->BASE0 = saved_BASE0;
  BALEN = saved_BALEN; 
  apply_pcnf0_pcnf1();

  if (best_hits >= min_hits) {
    discovered_prefix = best_prefix;
    have_prefix = true;

    // Apply the *new* found prefix
    restore_single_pipe_prefix(discovered_prefix);
    NRF_RADIO->BASE0 = 0x00000000; // Base is 0 for now
    BALEN = 1;
    apply_pcnf0_pcnf1();
    set_channel(best_ch_found);

    Serial.print(">>> Prefix found & validated: 0x");
    Serial.print(discovered_prefix, HEX);
    Serial.print(" (hits="); Serial.print(best_hits); Serial.println(")");
    Serial.print(">>> Radio locked to [0x"); Serial.print(discovered_prefix, HEX); Serial.println("][0x00]");
    Serial.println(">>> Press 'Y' to find the next base byte.");
    return true;
  } else {
    set_channel(best_ch_found);
    Serial.println(">>> No stable prefix validated. Try again.");
    return false;
  }
}

/**
 * @brief Brute-force scan for the *next* base address byte (0x00..0xFF).
 * Requires a known prefix.
 */
bool run_next_byte_scan(uint8_t *found_byte) {
  if (!have_prefix) {
    Serial.println("Next-byte scan needs a known prefix. Press 'X' first.");
    return false;
  }
  if (currentState != LISTENING) {
    Serial.println("Next-byte scan requires LISTENING (locked channel). Sweep first.");
    return false;
  }
  if (preamble_trick_mode > 0) {
    Serial.println("Preamble Sniff Trick is ON. Disable with 'a' to use Address Discovery.");
    return false;
  }

  uint8_t target_index = discovered_count; // This is the byte we are looking for (0-3)
  if (target_index >= 4) {
    Serial.println("Already have 4 base bytes.");
    return false;
  }

  Serial.print("\n--- Next-byte scan (discovering base byte #");
  Serial.print(target_index); Serial.println(") ---");
  Serial.println("Tip: keep transmitting (press the button).");
  suppress_prints = true;

