HafthorArni/nRF52840_Mousejacker/nrf52840_sniffer/extras/main_sniffer_with_nrf24.cpp
    String byte_str = s.substring(start_idx, end_idx);
    byte_str.trim();

    if (byte_str.length() > 0) {
      byte b = (byte)strtoul(byte_str.c_str(), NULL, 16);

      if (first_byte) {
        discovered_prefix = b;
        have_prefix = true;
        first_byte = false;
      } else if (discovered_count < 4) {
        discovered_base[discovered_count] = b;
        final_base |= ((uint32_t)b) << (8 * discovered_count);
        discovered_count++;
      }
    }

    start_idx = end_idx + 1;
    if (start_idx >= (int)s.length()) break;
    end_idx = s.indexOf(' ', start_idx);
  }

  BALEN = (discovered_count == 0) ? 1 : discovered_count;
  
  configure_radio_for_state(LISTENING);

  if (currentState == IDLE) {
      Serial.println(">>> IDLE exit: Manual address set.");
      currentState = LISTENING; // Force state change
  }

  Serial.println(">>> Manual address set.");
  print_params();
}

// ---------------- UI / Keyboard ----------------
void print_help() {
  Serial.println(F("\nKeys:"));
  Serial.println(F("  h : help"));
  Serial.println(F("  S : run a single sweep"));
  Serial.println(F("  P : print current parameter settings"));
  Serial.println(F("  T : set exact RSSI threshold in dBm (e.g., -55) then Enter"));
  Serial.println(F("  [ : raise RSSI threshold by +5 dB"));
  Serial.println(F("  ] : lower RSSI threshold by -5 dB"));
  Serial.println(F("  --------------------------- Discovery ---------------------------"));
  Serial.println(F("  A : (Uppercase) set manual address (e.g., AA 12 34)"));
  Serial.println(F("  X : prefix scan (validated; uses ADDRESS hits)"));
  Serial.println(F("  Y : next-byte scan (prefix fixed; brute-force next byte)"));
  Serial.println(F("  U : undo last discovered base byte"));
  Serial.println(F("  Z : reset discovery (clear prefix + base bytes)"));
  Serial.println(F("  ------------------------- Record / Fire -------------------------"));
  Serial.println(F("  R : (Uppercase) toggle packet recording (LISTENING only)"));
  Serial.println(F("  f : (lowercase) fire (transmit) recorded packets"));
  Serial.println(F("  ---------------------- Sniffer (LISTENING) ----------------------"));
  Serial.println(F("  W : toggle whitening"));
  Serial.println(F("  D : toggle data rate (1M/2M)"));
  Serial.println(F("  b : cycle BALEN (1..4)"));
  Serial.println(F("  l : cycle LFLEN (0..8)"));
  Serial.println(F("  s : cycle S1LEN (0..7)"));
  Serial.println(F("  t : cycle STATLEN (0/6/8/16/24/32/64)"));
  Serial.println(F("  K : (Uppercase) set exact STATLEN (0-255) then Enter"));
  Serial.println(F("  C : (Uppercase) cycle CRC (Off/1B/2B)"));
  Serial.println(F("  V : (Uppercase) cycle CRC Profile (Poly/Init)"));
  Serial.println(F("  e : cycle Payload Endianness (Little/Big)"));
  Serial.println(F("  i : cycle CRC Skip Address (Include/Skip)"));
  Serial.println(F("  a : cycle Preamble Sniff Trick (Default/AA/55/AAAA/5555)"));
  Serial.println(F("  p : toggle header parsing (LEN/S1)"));
  Serial.println(F("  < / > : bit-shift printed payload left/right (-7 to +7)"));
  Serial.println(F("  + / - : channel up/down"));
  Serial.println(F("  c : enter channel number + Enter"));
  Serial.println(F("  r : (lowercase) reapply radio with current params"));
  Serial.print  (F("\nRSSI print gate: ")); Serial.print(PRINT_RSSI_THRESH); Serial.println(F(" dBm"));
}

String chan_entry;
String thresh_entry;
String addr_entry;
String statlen_entry;
bool entering_thresh = false;
bool entering_address = false;
bool entering_statlen = false;

void serial_commands() {
  while (Serial.available()) {
    char c = Serial.read();

    if (c == '\r' || c == '\n') {
      if (chan_entry.length()) { 
        int ch = chan_entry.toInt();
        chan_entry = "";
        if (ch >= MIN_CH && ch <= MAX_CH) {
          best_ch_found = (uint8_t)ch;
          
          if (currentState == IDLE) { 
            Serial.println(">>> IDLE exit: Manual channel set.");
            configure_radio_for_state(LISTENING);
            currentState = LISTENING;
          } else {
            set_channel(best_ch_found);
          }
          
          Serial.print("Channel set to "); Serial.println(best_ch_found);
        } else {
          Serial.println("Channel out of range.");
        }
      }

      if (entering_thresh && thresh_entry.length()) {
        int val = thresh_entry.toInt();
        if (val < -100) val = -100;
        if (val > -20)  val = -20;
        PRINT_RSSI_THRESH = (int8_t)val;
        Serial.print("RSSI print threshold set to "); Serial.print(PRINT_RSSI_THRESH); Serial.println(" dBm");
        entering_thresh = false;
        thresh_entry = "";
      }
      if (entering_address && addr_entry.length()) {
        set_manual_address(addr_entry);
        entering_address = false;
        addr_entry = "";
      }

      if (entering_statlen && statlen_entry.length()) {
        int len = statlen_entry.toInt();
        if (len < 0) len = 0;
        if (len > 255) len = 255;
        STATLEN = (uint8_t)len;
        apply_pcnf0_pcnf1();
        Serial.print("STATLEN manually set to "); Serial.println(STATLEN);
        entering_statlen = false;
        statlen_entry = "";
      }

      continue;
    }

    if (chan_entry.length()) {
      if (isDigit(c)) { chan_entry += c; Serial.print(c); continue; }
      else chan_entry = "";
    }

    if (entering_thresh && (isDigit(c) || c=='-')) {
      thresh_entry += c; Serial.print(c); continue;
    } else if (entering_thresh && !(c=='\r' || c=='\n')) {
      entering_thresh = false; thresh_entry = "";
    }

    if (entering_address && (isDigit(c) || (c>='a' && c<='f') || (c>='A' && c<='F') || c==' ')) {
      addr_entry += c; Serial.print(c); continue;
    } else if (entering_address) {
      entering_address = false; addr_entry = "";
    }

    if (entering_statlen && isDigit(c)) {
      statlen_entry += c; Serial.print(c); continue;
    } else if (entering_statlen && !(c=='\r' || c=='\n')) {
      entering_statlen = false; statlen_entry = "";
    }

    switch (c) {
      case 'h': case 'H': print_help(); break;
      case 'P': print_params(); break;

      case '[': {
        int newv = (int)PRINT_RSSI_THRESH + 5;
        if (newv > -20) newv = -20;
        PRINT_RSSI_THRESH = (int8_t)newv;
        Serial.print("RSSI print threshold = "); Serial.print(PRINT_RSSI_THRESH); Serial.println(" dBm");
        break;
      }
      case ']': {
        int newv = (int)PRINT_RSSI_THRESH - 5;
        if (newv < -100) newv = -100;
        PRINT_RSSI_THRESH = (int8_t)newv;
        Serial.print("RSSI print threshold = "); Serial.print(PRINT_RSSI_THRESH); Serial.println(" dBm");
        break;
      }
      case 'T':
        Serial.println("Enter RSSI threshold in dBm (e.g., -55) then Enter:");
        entering_thresh = true; thresh_entry = "";
        break;

