HafthorArni/nRF52840_Mousejacker/nrf52840_sniffer/extras/main_sniffer_with_nrf24.cpp
      case 'S':
        Serial.println(">>> Starting single sweep...");
        currentState = SWEEPING;
        configure_radio_for_state(SWEEPING);
        break;

      case 'Z':
        discovery_reset_all();
        break;

      case 'U':
        discovery_undo_last_byte();
        break;

      case 'A': {
        if (preamble_trick_mode > 0) {
          Serial.println("Preamble Sniff Trick is ON. Disable with 'a' to set manual address.");
          break;
        }
        Serial.println("Enter full address (Prefix + Base) as hex bytes, space separated:");
        Serial.println("e.g., AA 12 34 56 78 (for 5 bytes) or AA 12 34 (for 3 bytes)");
        entering_address = true;
        addr_entry = "";
        break;
      }

      case 'X': {
        if (currentState != LISTENING) { Serial.println("Not in LISTENING. Sweep first."); break; }
        run_prefix_scan();
        break;
      }
      case 'Y': {
        if (currentState != LISTENING) { Serial.println("Not in LISTENING. Sweep first."); break; }
        if (!have_prefix) { Serial.println("No prefix yet. Press 'X' first."); break; }
        uint8_t b;
        if (run_next_byte_scan(&b)) {}
        break;
      }

      case 'R': // Uppercase R for Record toggle
        if (currentState != LISTENING) {
          Serial.println("Must be in LISTENING mode to record.");
          break;
        }
        is_recording = !is_recording;
        if (is_recording) {
          Serial.print(">>> RECORDING ARMED. Clearing old packets. Max=");
          Serial.print(MAX_RECORDED_PACKETS);
          Serial.println(" packets.");
          recorded_packet_count = 0;
          memset(recorded_packets, 0, sizeof(recorded_packets));
          digitalWrite(LED_PIN, LOW); // LED on solid
        } else {
          Serial.print(">>> RECORDING STOPPED. Captured ");
          Serial.print(recorded_packet_count);
          Serial.println(" packets.");
          digitalWrite(LED_PIN, HIGH); // LED off
        }
        break;
        
      case 'f': // lowercase f for fire
        if (is_recording) {
          Serial.println("Cannot 'fire' while recording is active. Press 'R' to stop first.");
          break;
        }
        if (recorded_packet_count == 0) {
          Serial.println("No packets recorded. Press 'R' to start/stop recording first.");
          break;
        }
        Serial.print(">>> Firing ");
        Serial.print(recorded_packet_count);
        Serial.println(" recorded packets...");
        fire_recorded_packets(); 
        break;

      default:
        if (currentState != LISTENING) {
          if (c == 'c') {
            Serial.println("Enter channel number + Enter:"); chan_entry = ""; break;
          }
          if (isDigit(c)) {
            chan_entry = String(c); Serial.print(c); break;
          }
          Serial.println("Not in LISTENING yet. Press 'S' or D7 to sweep first.");
          break;
        }
        // --- Keys below only work when LISTENING ---
        switch (c) {
          case 'W':
            whitening_enabled = !whitening_enabled; 
            apply_pcnf0_pcnf1();
            set_channel(best_ch_found);
            Serial.print("Whitening "); Serial.println(whitening_enabled ? "ENABLED" : "DISABLED");
            break;
            
          case 'e':
            payload_endian_little = !payload_endian_little;
            apply_pcnf0_pcnf1();
            set_channel(best_ch_found); 
            Serial.print("Payload Endian set to: "); Serial.println(payload_endian_little ? "Little (nRF)" : "Big (BLE)");
            break;
            
          case 'D':
            current_mode = (current_mode == RADIO_MODE_MODE_Nrf_2Mbit)
                             ? RADIO_MODE_MODE_Nrf_1Mbit : RADIO_MODE_MODE_Nrf_2Mbit;
            NRF_RADIO->MODE = current_mode << RADIO_MODE_MODE_Pos;
            set_channel(best_ch_found);
            Serial.print("Data rate: "); Serial.println((current_mode == RADIO_MODE_MODE_Nrf_2Mbit) ? "2M" : "1M");
            break;
          case 'b':
            BALEN = (BALEN % 4) + 1;
            apply_pcnf0_pcnf1();
            set_channel(best_ch_found); 
            Serial.print("BALEN="); Serial.println(BALEN);
            if (preamble_trick_mode > 0) { Serial.println(">>> (NOTE: BALEN is overridden by Preamble Trick)"); }
            break;
          case 'l':
            LFLEN = (LFLEN + 1) % 9; apply_pcnf0_pcnf1();
            Serial.print("LFLEN="); Serial.println(LFLEN);
            set_channel(best_ch_found); 
            break;
          case 's':
            S1LEN = (S1LEN + 1) % 8; apply_pcnf0_pcnf1();
            Serial.print("S1LEN="); Serial.println(S1LEN);
            set_channel(best_ch_found);
            break;
          case 't':
            if (STATLEN == 0) STATLEN = 6;
            else if (STATLEN == 6) STATLEN = 8;
            else if (STATLEN == 8) STATLEN = 16;
            else if (STATLEN == 16) STATLEN = 24;
            else if (STATLEN == 24) STATLEN = 32;
            else if (STATLEN == 32) STATLEN = 64; 
            else STATLEN = 0;
            apply_pcnf0_pcnf1();
            Serial.print("STATLEN="); Serial.println(STATLEN);
            set_channel(best_ch_found);
            break;

          case 'K':
            Serial.println("Enter exact STATLEN (0-255) then Enter:");
            entering_statlen = true;
            statlen_entry = "";
            set_channel(best_ch_found); 
            break;

          case 'i':
            crc_skip_addr = !crc_skip_addr;
            configure_radio_for_state(LISTENING);
            Serial.print("CRC Skip Address set to: "); Serial.println(crc_skip_addr ? "Skip (Payload Only)" : "Include (Addr + Payload)");
            break;
            
          case 'V':
            crc_param_profile = (crc_param_profile + 1) % 4; // Cycle 0-3
            configure_radio_for_state(LISTENING);
            Serial.print("CRC Profile set to: ");
            switch (crc_param_profile) {
              case 0: Serial.println(F("0: Default (Poly:0x1021, Init:0xFFFF)")); break;
              case 1: Serial.println(F("1: Kermit  (Poly:0x1021, Init:0x0000)")); break;
              case 2: Serial.println(F("2: Modbus  (Poly:0x8005, Init:0xFFFF)")); break;
              case 3: Serial.println(F("3: ARC     (Poly:0x8005, Init:0x0000)")); break;
            }
            break;

