HafthorArni/nRF52840_Mousejacker/nrf52840_sniffer/extras/main_sniffer_with_nrf24.cpp
          case 'C':
            current_crc_len = (current_crc_len + 1) % 3; // 0 -> 1 -> 2 -> 0
            configure_radio_for_state(LISTENING);
            Serial.print("CRC set to: ");
            if (current_crc_len == 0) Serial.println(F("DISABLED"));
            else if (current_crc_len == 1) Serial.println(F("1 Byte"));
            else if (current_crc_len == 2) Serial.println(F("2 Bytes"));
            break;

          case 'p':
            header_parse_enabled = !header_parse_enabled;
            Serial.print("Header parsing "); Serial.println(header_parse_enabled ? "ENABLED" : "DISABLED");
            break;
          case '+':
            if (best_ch_found < MAX_CH) { best_ch_found++; set_channel(best_ch_found); }
            Serial.print("Channel -> "); Serial.println(best_ch_found);
            break;
          case '-':
            if (best_ch_found > MIN_CH) { best_ch_found--; set_channel(best_ch_found); }
            Serial.print("Channel -> "); Serial.println(best_ch_found);
            break;
          case 'c':
            Serial.println("Enter channel number + Enter:"); chan_entry = ""; break;

          case 'r':
            Serial.println("Reapplying radio with current params...");
            configure_radio_for_state(LISTENING);
            break;
            
          case '<': // Shift LEFT
            bit_shift_amount = (bit_shift_amount - 1);
            if (bit_shift_amount < -7) bit_shift_amount = 7;
            Serial.print("Bit shift set to: "); Serial.println(bit_shift_amount);
            break;
          case '>': // Shift RIGHT
            bit_shift_amount = (bit_shift_amount + 1);
            if (bit_shift_amount > 7) bit_shift_amount = -7;
            Serial.print("Bit shift set to: "); Serial.println(bit_shift_amount);
            break;

          case 'a': // Preamble Trick
            preamble_trick_mode = (preamble_trick_mode + 1) % 5;
            Serial.print("Preamble Sniff Trick set to: ");
            switch (preamble_trick_mode) {
              case 0: Serial.println(F("OFF (Using Address Discovery)")); break;
              case 1: Serial.println(F("ON: 0xAA (1-byte)")); break;
              case 2: Serial.println(F("ON: 0x55 (1-byte)")); break;
              case 3: Serial.println(F("ON: 0xAAAA (2-byte)")); break;
              case 4: Serial.println(F("ON: 0x5555 (2-byte)")); break;
            }
            if (preamble_trick_mode > 0) {
              Serial.println(F(">>> NOTE: Address discovery/settings are now overridden."));
            } else {
              Serial.println(F(">>> NOTE: Reverting to discovered address."));
            }
            configure_radio_for_state(LISTENING);
            break;

          default:
            if (isDigit(c)) { chan_entry = String(c); Serial.print(c); }
            else { Serial.print("Unknown key: "); Serial.println(c); }
            break;
        }
        break;
    }
  }
}

// ---------------- Setup / Loop ----------------
void setup() {
  pinMode(LED_PIN, OUTPUT); digitalWrite(LED_PIN, HIGH); // HIGH = LED OFF
  pinMode(BUTTON_PIN, INPUT_PULLUP);

  Serial.begin(SERIAL_BAUD);
  unsigned long t0 = millis();
  while (!Serial && millis() - t0 < 1500) {}

  Serial.println("\n--- nRF52840 Sniffer + TX Test Bench ---");
  Serial.println("<<< nRF24 (TX) and nRF52 (Sniffer) running on same board >>>");

  // Configure the external nRF24L01+ as our target transmitter
  configure_target_transmitter();

  Serial.println("\nInternal nRF52 (Sniffer) ready.");
  Serial.println("Press D7 or 'S' to sweep, or 'c'/'A' to set params.");
  print_help();

  radio_disable(); // Disable sniffer radio initially
  currentState = IDLE;
  locked = false;
}

bool btn_prev = false;
static bool tx_ok_logged = false;
void loop() {
  // 1. Run the target transmitter (non-blocking)
  run_target_transmitter(); 

  if (!tx_ok_logged) {
    char tx[TARGET_RADIO_PAYLOAD_SIZE] = {0};
    if (radio.write(&tx, 0)) { // Send a 0-byte test packet
      Serial.println("\n>>> TX DIAGNOSTIC: radio.write() Succeeded. Transmitter is likely working.\n");
      tx_ok_logged = true;
    }
  }

  // 2. Check for button press to start sweep
  bool btn = (digitalRead(BUTTON_PIN) == LOW);
  if (btn && !btn_prev) {
    delay(20);
    if (digitalRead(BUTTON_PIN) == LOW) {
      Serial.println(">>> Button: starting single sweep...");
      
      if (is_recording) {
        is_recording = false;
        digitalWrite(LED_PIN, HIGH);
        Serial.println(">>> Recording stopped by sweep button.");
      }

      currentState = SWEEPING;
      configure_radio_for_state(SWEEPING);
    }
  }
  btn_prev = btn;

  // 3. Process serial commands from user
  serial_commands();

  // 4. Run the sniffer state machine
  switch (currentState) {
    case IDLE:
      delay(1);
      break;

    case SWEEPING: {
      uint8_t found = sweep_once_find_best();
      currentState = ANALYZING;
      radio_disable();
      Serial.println("\n--- Sweep done ---");
      if (found) { Serial.print("Best channel: "); Serial.println(found); }
      else { Serial.println("No channel activity found."); }
      break;
    }

    case ANALYZING: {
      if (best_ch_found) {
        locked = true;
        configure_radio_for_state(LISTENING);
        Serial.print(">>> Locked to channel "); Serial.println(best_ch_found);
        currentState = LISTENING;
      } else {
        locked = false;
        currentState = IDLE;
        Serial.println(">>> Returning to IDLE. Press D7 or 'S' to sweep again.");
      }
      break;
    }

    case LISTENING:
      poll_radio_events(best_ch_found, /*allow_prints=*/true);
      break;
  }
}